---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsZeroDesiredRisers
source: html/00077047-bcc4-4b8f-8a52-07340ec04412.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsZeroDesiredRisers Property

The number of desired risers for a staircase cannot be 0.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsZeroDesiredRisers { get; }
```